doc/authrequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header></soap:Header>
	<soap:Body>
<AuthRequest xmlns="urn:zimbraAccount">
   <account by="name">nanchen</account>
   <password></password>
 </AuthRequest>
 </soap:Body></soap:Envelope>