core/src/test/resources/soap/requests/GetInfoRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
  <S:Header>
    <ns4:context xmlns="urn:zimbraAdmin" xmlns:ns2="urn:zimbraMail" xmlns:ns3="urn:zimbraAccount" xmlns:ns4="urn:zimbra">
      <ns4:authToken>%AUTH_TOKEN%</ns4:authToken>
      <ns4:authTokenControl voidOnExpired="true"/>
    </ns4:context>
    <context xmlns="urn:zimbra">
      <authTokenControl voidOnExpired="true"/>
    </context>
  </S:Header>
  <S:Body>
    <ns3:GetInfoRequest xmlns="urn:zimbraAdmin" xmlns:ns2="urn:zimbraMail" xmlns:ns3="urn:zimbraAccount" xmlns:ns4="urn:zimbra" sections="children,attrs,prefs"/>
  </S:Body>
</S:Envelope>